/**
 * @author zhangyi
 */
	var DICT = {};
	
	DICT.province = {0:"北京",1:"天津",2:"上海",3:"重庆",4:"河北",5:"河南",6:"黑龙江",7:"吉林",8:"辽宁",9:"山东",10:"内蒙古",11:"江苏",12:"安徽",13:"山西",14:"陕西",15:"甘肃",16:"浙江",17:"江西",18:"湖北",19:"湖南",20:"贵州",21:"四川",22:"云南",23:"新疆",24:"宁夏",25:"青海",26:"西藏",27:"广西",28:"广东",29:"福建",30:"海南",31:"台湾",32:"香港",33:"澳门"};
	DICT.cities = {0:{0:"昌平",1:"朝阳",2:"崇文",3:"大兴",4:"东城",5:"房山",6:"丰台",7:"海淀",8:"怀柔",9:"门头沟",10:"密云",11:"平谷",12:"石景山",13:"顺义",14:"通州",15:"西城",16:"宣武",17:"延庆"},1:{100:"宝坻",101:"北辰",102:"大港",103:"东丽",104:"汉沽",105:"和平",106:"河北",107:"河东",108:"河西",109:"红桥",110:"蓟县",111:"津南",112:"静海",113:"南开",114:"宁河",115:"塘沽",116:"武清",117:"西青"},2:{200:"宝山",201:"长宁",202:"崇明",203:"奉贤",204:"虹口",205:"黄浦",206:"嘉定",207:"金山",208:"静安",209:"卢湾",210:"闵行",211:"南汇",212:"浦东",213:"普陀",214:"青浦",215:"松江",216:"徐汇",217:"杨浦",218:"闸北"},3:{300:"巴南",301:"北碚",302:"璧山",303:"长寿",304:"城口",305:"大渡口",306:"大足",307:"垫江",308:"丰都",309:"奉节",310:"涪陵",311:"合川",312:"江北",313:"江津",314:"九龙坡",315:"开县",316:"梁平",317:"南岸",318:"南川",319:"彭水",320:"綦江",321:"黔江",322:"荣昌",323:"沙坪坝",324:"石柱双桥",325:"铜梁",326:"潼南",327:"万盛",328:"万州",329:"巫山",330:"巫溪",331:"武隆",332:"秀山",333:"永川",334:"酉阳",335:"渝北",336:"渝中",337:"云阳",338:"忠县"},4:{400:"石家庄",401:"保定",402:"沧州",403:"承德",404:"邯郸",405:"衡水",406:"廊坊",407:"秦皇岛",408:"唐山",409:"邢台",410:"张家口"},5:{500:"郑州",501:"安阳",502:"鹤壁",503:"焦作",504:"开封",505:"洛阳",506:"漯河",507:"南阳",508:"平顶山",509:"濮阳",510:"三门峡",511:"商丘",512:"新乡",513:"信阳",514:"许昌",515:"周口",516:"驻马店"},6:{600:"哈尔滨",601:"大庆",602:"大兴安岭",603:"鹤岗",604:"黑河",605:"鸡西",606:"佳木斯",607:"牡丹江",608:"七台河",609:"齐齐哈尔",610:"双鸭山",611:"绥化",612:"伊春"},7:{700:"长春",701:"白城",702:"白山",703:"吉林",704:"辽源",705:"四平",706:"松原",707:"通化",708:"延边"},8:{800:"沈阳",801:"鞍山",802:"本溪",803:"朝阳",804:"大连",805:"丹东",806:"抚顺",807:"阜新",808:"葫芦岛",809:"锦州",810:"辽阳",811:"盘锦",812:"铁岭",813:"营口"},9:{900:"济南",901:"滨州",902:"德州",903:"东营",904:"菏泽",905:"济宁",906:"莱芜",907:"聊城",908:"临沂",909:"青岛",910:"日照",911:"泰安",912:"威海",913:"潍坊",914:"烟台",915:"枣庄",916:"淄博"},10:{1000:"呼和浩特",1001:"阿拉善",1002:"巴彦淖尔",1003:"包头",1004:"赤峰",1005:"鄂尔多斯",1006:"呼伦贝尔",1007:"通辽",1008:"乌海",1009:"乌兰察布",1010:"锡林",1011:"郭勒",1012:"兴安"},11:{1100:"南京",1101:"常州",1102:"淮安",1103:"连云港",1104:"南通",1105:"苏州",1106:"宿迁",1107:"泰州",1108:"无锡",1109:"徐州",1110:"盐城",1111:"扬州",1112:"镇江"},12:{1200:"合肥",1201:"安庆",1202:"蚌埠",1203:"亳州",1204:"巢湖",1205:"池州",1206:"滁州",1207:"阜阳",1208:"淮北",1209:"淮南",1210:"黄山",1211:"六安",1212:"马鞍山",1213:"宿州",1214:"铜陵",1215:"芜湖",1216:"宣城"},13:{1300:"太原",1301:"长治",1302:"大同",1303:"晋城",1304:"晋中",1305:"临汾",1306:"吕梁",1307:"朔州",1308:"忻州",1309:"阳泉",1310:"运城"},14:{1400:"西安",1401:"安康",1402:"宝鸡",1403:"汉中",1404:"商洛",1405:"铜川",1406:"渭南",1407:"咸阳",1408:"延安",1409:"榆林"},15:{1500:"兰州",1501:"白银",1502:"定西",1503:"甘南",1504:"嘉峪关",1505:"金昌",1506:"酒泉",1507:"临夏",1508:"陇南",1509:"平凉",1510:"庆阳",1511:"天水",1512:"武威",1513:"张掖"},16:{1600:"杭州",1601:"湖州",1602:"嘉兴",1603:"金华",1604:"丽水",1605:"宁波",1606:"衢州",1607:"绍兴",1608:"台州",1609:"温州",1610:"舟山"},17:{1700:"南昌",1701:"抚州",1702:"赣州",1703:"吉安",1704:"景德镇",1705:"九江",1706:"萍乡",1707:"上饶",1708:"新余",1709:"宜春",1710:"鹰潭"},18:{1800:"武汉",1801:"鄂州",1802:"恩施",1803:"黄冈",1804:"黄石",1805:"荆门",1806:"荆州",1807:"潜江",1808:"神农架",1809:"十堰",1810:"随州",1811:"天门",1812:"仙桃",1813:"咸宁",1814:"襄樊",1815:"孝感",1816:"宜昌"},19:{1900:"长沙",1901:"常德",1902:"郴州",1903:"衡阳",1904:"怀化",1905:"娄底",1906:"邵阳",1907:"湘潭",1908:"湘西",1909:"益阳",1910:"永州",1911:"岳阳",1912:"张家界",1913:"株洲"},20:{2000:"贵阳",2001:"安顺",2002:"毕节",2003:"六盘水",2004:"黔东南",2005:"黔南",2006:"黔西南",2007:"铜仁",2008:"遵义"},21:{2100:"成都",2101:"阿坝",2102:"巴中",2103:"达州",2104:"德阳",2105:"甘孜",2106:"广安",2107:"广元",2108:"乐山",2109:"凉山",2110:"泸州",2111:"眉山",2112:"绵阳",2113:"内江",2114:"南充",2115:"攀枝花",2116:"遂宁",2117:"雅安",2118:"宜宾",2119:"资阳",2120:"自贡"},22:{2200:"昆明",2201:"保山",2202:"楚雄",2203:"大理",2204:"德宏",2205:"迪庆",2206:"红河",2207:"丽江",2208:"临沧",2209:"怒江",2210:"曲靖",2211:"思茅",2212:"文山",2213:"西双版纳",2214:"玉溪",2215:"昭通"},23:{2300:"乌鲁木齐",2301:"阿克苏",2302:"阿拉尔",2303:"阿勒泰",2304:"巴音郭楞",2305:"博尔塔拉",2306:"昌吉",2307:"哈密",2308:"和田",2309:"喀什",2310:"克拉玛依",2311:"克州",2312:"石河子",2313:"塔城",2314:"图木舒克",2315:"吐鲁番",2316:"五家渠",2317:"伊犁"},24:{2400:"银川",2401:"固原",2402:"石嘴山",2403:"吴忠",2404:"中卫"},25:{2500:"西宁",2501:"果洛",2502:"海北",2503:"海东",2504:"海南",2505:"海西",2506:"黄南",2507:"玉树"},26:{2600:"拉萨",2601:"阿里",2602:"昌都",2603:"林芝",2604:"那曲",2605:"日喀则",2606:"山南"},27:{2700:"桂林",2701:"百色",2702:"北海",2703:"崇左",2704:"防城港",2705:"贵港",2706:"河池",2707:"贺州",2708:"来宾",2709:"柳州",2710:"南宁",2711:"钦州",2712:"梧州",2713:"玉林"},28:{2800:"广州",2801:"潮州",2802:"东莞",2803:"佛山",2804:"河源",2805:"惠州",2806:"江门",2807:"揭阳",2808:"茂名",2809:"梅州",2810:"清远",2811:"汕头",2812:"汕尾",2813:"韶关",2814:"深圳",2815:"阳江",2816:"云浮",2817:"湛江",2818:"肇庆",2819:"中山",2820:"珠海"},29:{2900:"福州",2901:"龙岩",2902:"南平",2903:"宁德",2904:"莆田",2905:"泉州",2906:"三明",2907:"厦门",2908:"漳州"},30:{3000:"海口",3001:"白沙",3002:"保亭",3003:"昌江",3004:"澄迈",3005:"儋州",3006:"定安",3007:"东方",3008:"乐东",3009:"临高",3010:"陵水",3011:"南沙群海",3012:"琼中",3013:"三亚",3014:"屯昌",3015:"万宁",3016:"文昌",3017:"五指山",3018:"西沙群岛",3019:"中沙群岛"},31:{3100:"台北",3101:"阿莲",3102:"安定",3103:"安平",3104:"八德",3105:"八里",3106:"白河",3107:"白沙",3108:"板桥",3109:"褒忠",3110:"宝山",3111:"卑南",3112:"北斗",3113:"北港",3114:"北门",3115:"北埔",3116:"北投",3117:"补子",3118:"布袋",3119:"草屯",3120:"长宾",3121:"长治",3122:"潮州",3123:"车城",3124:"成功",3125:"城中区",3126:"池上",3127:"春日",3128:"刺桐",3129:"高雄",3130:"花莲",3131:"基隆",3132:"嘉义",3133:"苗栗",3134:"南投",3135:"屏东",3136:"台东",3137:"台南",3138:"台中",3139:"桃园",3140:"新竹",3141:"宜兰",3142:"彰化"},32:{3200:"北区",3201:"大埔区",3202:"东区",3203:"观塘区",3204:"黄大仙区",3205:"九龙",3206:"葵青",3207:"离岛",3208:"南区",3209:"荃湾区",3210:"沙田区",3211:"深水埗",3212:"屯门",3213:"湾仔",3214:"西贡",3215:"香港",3216:"新界",3217:"油尖旺",3218:"元朗",3219:"中西区"},33:{3300:"澳门"}};

	DICT.getcity = function(ctid) {
		var ret = "";
		ctid = ctid.toString();
		if(ctid.length>0) {
			if (ctid.length == 1) {
				ret = DICT.cities[0][ctid];
			} else {
				provid = ctid.substr(0, 1);
				ret = DICT.cities[provid][ctid];
				if (!ret) {
					provid = ctid.substr(0, 2);;
					ret = DICT.cities[provid][ctid];
				}
			}
		}
		return ret;
	}

	var prov = DICT.province;
	var city = DICT.cities;	
	
	function loadProv(obj) {
		for (var i = 0 ; prov[i] ; i++ )
		{
			var opt = document.createElement("option");
			var opt_txt = document.createTextNode(prov[i]);
			opt.value = i;
			opt.appendChild(opt_txt);
			obj.appendChild(opt);	
			opt_txt = null;
			opt = null;
		}
	}

	function loadCity(selP,selC,has) {
//		alert(selP.options.length);
		
		var len = selP.value;
		
//		alert(len);
		
		if(len == "-1") {
			selC.options.length = 1;
			return;
		}
		else{
			var sellen = selC.options.length;
			if(sellen > 0) {
				if(has == undefined) {
					selC.options.length = 1;
				}else {
					selC.options.length = 0;
				}
			}
			var pos = len*100;
			for(var i = 0 ; city[len][len*100+i];i++)
			{				
				var opt = document.createElement("option");
				var opt_txt = document.createTextNode(city[len][pos+i]);
				opt.value = pos+i;
				opt.appendChild(opt_txt);
				selC.appendChild(opt);	
				opt_txt = null;
				opt = null;
			}				
			pos = null;
			len = null;
			sellen = null;
			i = null;
		}			
	}
